<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/2%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B014(0804).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
ll=[{'name':'John','job':'teacher'},
   {'name':'Nate','job':'student'},
   {'name':'John','job':'developer'},]
l2=[{'name':'Ed','job':'dentist'},
   {'name':'Jack','job':'farmer'},
   {'name':'Ted','job':'designer'},]
l3=[{'name':'John','job':'teacher'},
   {'name':'Nate','job':'student'},
   {'name':'Jack','job':'developer'},]
l4=[{'age':25,'country':'U.S'},
   {'age':30,'country':'U.K'},
   {'age':45,'country':'Korea'},]

In [ ]:
df1=pd.DataFrame(ll,columns=['name','job'])
df2=pd.DataFrame(l2,columns=['name','job'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  John  developer

In [ ]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [ ]:
result=pd.concat([df1,df2])#concat으로 열 합치기

In [ ]:
result

   name        job
0  John    teacher
1  Nate    student
2  John  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [ ]:
#인덱스 번호가 중복됨

In [ ]:
result=pd.concat([df1,df2],ignore_index=True)#인덱스 번호를 차례대로 함

In [ ]:
result

   name        job
0  John    teacher
1  Nate    student
2  John  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [ ]:
result= df1.append(df2)#concat이 아닌 다른 방법으로 열병합하기

In [ ]:
result

   name        job
0  John    teacher
1  Nate    student
2  John  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [ ]:
result= df1.append(df2,ignore_index=True)#인덱스 번호를 중복되는것을 무시

In [ ]:
result

   name        job
0  John    teacher
1  Nate    student
2  John  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [ ]:
#같은 행으로 합치기

In [ ]:
df1=pd.DataFrame(l3,columns=['name','job'])
df2=pd.DataFrame(l4,columns=['age','country'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [ ]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [ ]:
result=pd.concat([df1,df2],axis=1,ignore_index=True)#행으로 합치기 때문.행이 아닌 열로 들어감

In [ ]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

In [ ]:
label=[1,2,3,4,5]
prediction=[1,2,2,4,4]

In [ ]:
comparision=pd.DataFrame({'label':label,'prediction':prediction})#리스트끼리 합치기

In [ ]:
comparision

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4